HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xa/IfxHsct_bf.h
/** \\brief  Length for Ifx_HSCT_CONFIGPHY_Bits.PLLPON */
#define IFX_HSCT_CONFIGPHY_PLLPON_LEN (1)

/** \\brief  Mask for Ifx_HSCT_CONFIGPHY_Bits.PLLPON */
#define IFX_HSCT_CONFIGPHY_PLLPON_MSK (0x1)

/** \\brief  Offset for Ifx_HSCT_CONFIGPHY_Bits.PLLPON */
#define IFX_HSCT_CONFIGPHY_PLLPON_OFF (1)

/** \\brief  Length for Ifx_HSCT_CONFIGPHY_Bits.PLLWMF */
#define IFX_HSCT_CONFIGPHY_PLLWMF_LEN (6)

/** \\brief  Mask for Ifx_HSCT_CONFIGPHY_Bits.PLLWMF */
#define IFX_HSCT_CONFIGPHY_PLLWMF_MSK (0x3f)

/** \\brief  Offset for Ifx_HSCT_CONFIGPHY_Bits.PLLWMF */
#define IFX_HSCT_CONFIGPHY_PLLWMF_OFF (8)

/** \\brief  Length for Ifx_HSCT_CTSCTRL_Bits.CTS_FRAME */
#define IFX_HSCT_CTSCTRL_CTS_FRAME_LEN (1)

/** \\brief  Mask for Ifx_HSCT_CTSCTRL_Bits.CTS_FRAME */
#define IFX_HSCT_CTSCTRL_CTS_FRAME_MSK (0x1)

/** \\brief  Offset for Ifx_HSCT_CTSCTRL_Bits.CTS_FRAME */
#define IFX_HSCT_CTSCTRL_CTS_FRAME_OFF (0)

/** \\brief  Length for Ifx_HSCT_CTSCTRL_Bits.CTS_RXD */
#define IFX_HSCT_CTSCTRL_CTS_RXD_LEN (1)

/** \\brief  Mask for Ifx_HSCT_CTSCTRL_Bits.CTS_RXD */
#define IFX_HSCT_CTSCTRL_CTS_RXD_MSK (0x1)

/** \\brief  Offset for Ifx_HSCT_CTSCTRL_Bits.CTS_RXD */
#define IFX_HSCT_CTSCTRL_CTS_RXD_OFF (2)

/** \\brief  Length for Ifx_HSCT_CTSCTRL_Bits.CTS_TXD */
#define IFX_HSCT_CTSCTRL_CTS_TXD_LEN (1)

/** \\brief  Mask for Ifx_HSCT_CTSCTRL_Bits.CTS_TXD */
#define IFX_HSCT_CTSCTRL_CTS_TXD_MSK (0x1)

/** \\brief  Offset for Ifx_HSCT_CTSCTRL_Bits.CTS_TXD */
#define IFX_HSCT_CTSCTRL_CTS_TXD_OFF (1)

/** \\brief  Length for Ifx_HSCT_CTSCTRL_Bits.HSSL_CTS_FBD */
#define IFX_HSCT_CTSCTRL_HSSL_CTS_FBD_LEN (1)

/** \\brief  Mask for Ifx_HSCT_CTSCTRL_Bits.HSSL_CTS_FBD */
#define IFX_HSCT_CTSCTRL_HSSL_CTS_FBD_MSK (0x1)

/** \\brief  Offset for Ifx_HSCT_CTSCTRL_Bits.HSSL_CTS_FBD */
#define IFX_HSCT_CTSCTRL_HSSL_CTS_FBD_OFF (3)

/** \\brief  Length for Ifx_HSCT_DISABLE_Bits.RX_DIS */
#define IFX_HSCT_DISABLE_RX_DIS_LEN (1)

/** \\brief  Mask for Ifx_HSCT_DISABLE_Bits.RX_DIS */
#define IFX_HSCT_DISABLE_RX_DIS_MSK (0x1)

/** \\brief  Offset for Ifx_HSCT_DISABLE_Bits.RX_DIS */
#define IFX_HSCT_DISABLE_RX_DIS_OFF (1)

/** \\brief  Length for Ifx_HSCT_DISABLE_Bits.RX_HEPD */
#define IFX_HSCT_DISABLE_RX_HEPD_LEN (1)

/** \\brief  Mask for Ifx_HSCT_DISABLE_Bits.RX_HEPD */
#define IFX_HSCT_DISABLE_RX_HEPD_MSK (0x1)

/** \\brief  Offset for Ifx_HSCT_DISABLE_Bits.RX_HEPD */
#define IFX_HSCT_DISABLE_RX_HEPD_OFF (2)

/** \\brief  Length for Ifx_HSCT_DISABLE_Bits.TX_DIS */
#define IFX_HSCT_DISABLE_TX_DIS_LEN (1)

/** \\brief  Mask for Ifx_HSCT_DISABLE_Bits.TX_DIS */
#define IFX_HSCT_DISABLE_TX_DIS_MSK (0x1)

/** \\brief  Offset for Ifx_HSCT_DISABLE_Bits.TX_DIS */
#define IFX_HSCT_DISABLE_TX_DIS_OFF (0)

/** \\brief  Length for Ifx_HSCT_DISABLE_Bits.TX_PWDPD */
#define IFX_HSCT_DISABLE_TX_PWDPD_LEN (1)

/** \\brief  Mask for Ifx_HSCT_DISABLE_Bits.TX_PWDPD */
#define IFX_HSCT_DISABLE_TX_PWDPD_MSK (0x1)

/** \\brief  Offset for Ifx_HSCT_DISABLE_Bits.TX_PWDPD */
#define IFX_HSCT_DISABLE_TX_PWDPD_OFF (3)

/** \\brief  Length for Ifx_HSCT_ID_Bits.MODNUMBER */
#define IFX_HSCT_ID_MODNUMBER_LEN (16)

/** \\brief  Mask for Ifx_HSCT_ID_Bits.MODNUMBER */
#define IFX_HSCT_ID_MODNUMBER_MSK (0xffff)

/** \\brief  Offset for Ifx_HSCT_ID_Bits.MODNUMBER */
#define IFX_HSCT_ID_MODNUMBER_OFF (16)

/** \\brief  Length for Ifx_HSCT_ID_Bits.MODREV */
#define IFX_HSCT_ID_MODREV_LEN (8)

/** \\brief  Mask for Ifx_HSCT_ID_Bits.MODREV */
#define IFX_HSCT_ID_MODREV_MSK (0xff)

/** \\brief  Offset for Ifx_HSCT_ID_Bits.MODREV */
#define IFX_HSCT_ID_MODREV_OFF (0)

/** \\brief  Length for Ifx_HSCT_ID_Bits.MODTYPE */
#define IFX_HSCT_ID_MODTYPE_LEN (8)

/** \\brief  Mask for Ifx_HSCT_ID_Bits.MODTYPE */
#define IFX_HSCT_ID_MODTYPE_MSK (0xff)

/** \\brief  Offset for Ifx_HSCT_ID_Bits.MODTYPE */
#define IFX_HSCT_ID_MODTYPE_OFF (8)

/** \\brief  Length for Ifx_HSCT_IFCTRL_Bits.IFCVS */
#define IFX_HSCT_IFCTRL_IFCVS_LEN (8)

/** \\brief  Mask for Ifx_HSCT_IFCTRL_Bits.IFCVS */
#define IFX_HSCT_IFCTRL_IFCVS_MSK (0xff)

/** \\brief  Offset for Ifx_HSCT_IFCTRL_Bits.IFCVS */
#define IFX_HSCT_IFCTRL_IFCVS_OFF (0)

/** \\brief  Length for Ifx_HSCT_IFCTRL_Bits.IFTESTMD */
#define IFX_HSCT_IFCTRL_IFTESTMD_LEN (1)

/** \\brief  Mask for Ifx_HSCT_IFCTRL_Bits.IFTESTMD */
#define IFX_HSCT_IFCTRL_IFTESTMD_MSK (0x1)

/** \\brief  Offset for Ifx_HSCT_IFCTRL_Bits.IFTESTMD */
#define IFX_HSCT_IFCTRL_IFTESTMD_OFF (20)

/** \\brief  Length for Ifx_HSCT_IFCTRL_Bits.MRXSPEED */
#define IFX_HSCT_IFCTRL_MRXSPEED_LEN (2)

/** \\brief  Mask for Ifx_HSCT_IFCTRL_Bits.MRXSPEED */
#define IFX_HSCT_IFCTRL_MRXSPEED_MSK (0x3)

/** \\brief  Offset for Ifx_HSCT_IFCTRL_Bits.MRXSPEED */
#define IFX_HSCT_IFCTRL_MRXSPEED_OFF (16)

/** \\brief  Length for Ifx_HSCT_IFCTRL_Bits.MTXSPEED */
#define IFX_HSCT_IFCTRL_MTXSPEED_LEN (2)

/** \\brief  Mask for Ifx_HSCT_IFCTRL_Bits.MTXSPEED */
#define IFX_HSCT_IFCTRL_MTXSPEED_MSK (0x3)

/** \\brief  Offset for Ifx_HSCT_IFCTRL_Bits.MTXSPEED */
#define IFX_HSCT_IFCTRL_MTXSPEED_OFF (18)

/** \\brief  Length for Ifx_HSCT_IFCTRL_Bits.SIFCV */
#define IFX_HSCT_IFCTRL_SIFCV_LEN (1)

/** \\brief  Mask for Ifx_HSCT_IFCTRL_Bits.SIFCV */
#define IFX_HSCT_IFCTRL_SIFCV_MSK (0x1)

/** \\brief  Offset for Ifx_HSCT_IFCTRL_Bits.SIFCV */
#define IFX_HSCT_IFCTRL_SIFCV_OFF (8)

/** \\brief  Length for Ifx_HSCT_IFSTAT_Bits.RX_STAT */
#define IFX_HSCT_IFSTAT_RX_STAT_LEN (3)

/** \\brief  Mask for Ifx_HSCT_IFSTAT_Bits.RX_STAT */
#define IFX_HSCT_IFSTAT_RX_STAT_MSK (0x7)

/** \\brief  Offset for Ifx_HSCT_IFSTAT_Bits.RX_STAT */
#define IFX_HSCT_IFSTAT_RX_STAT_OFF (0)

/** \\brief  Length for Ifx_HSCT_IFSTAT_Bits.TX_STAT */
#define IFX_HSCT_IFSTAT_TX_STAT_LEN (2)

/** \\brief  Mask for Ifx_HSCT_IFSTAT_Bits.TX_STAT */
#define IFX_HSCT_IFSTAT_TX_STAT_MSK (0x3)

/** \\brief  Offset for Ifx_HSCT_IFSTAT_Bits.TX_STAT */
#define IFX_HSCT_IFSTAT_TX_STAT_OFF (3)

/** \\brief  Length for Ifx_HSCT_INIT_Bits.IFM */
#define IFX_HSCT_INIT_IFM_LEN (1)

/** \\brief  Mask for Ifx_HSCT_INIT_Bits.IFM */
#define IFX_HSCT_INIT_IFM_MSK (0x1)

/** \\brief  Offset for Ifx_HSCT_INIT_Bits.IFM */
#define IFX_HSCT_INIT_IFM_OFF (3)

/** \\brief  Length for Ifx_HSCT_INIT_Bits.LHLR */
#define IFX_HSCT_INIT_LHLR_LEN (1)

/** \\brief  Mask for Ifx_HSCT_INIT_Bits.LHLR */
#define IFX_HSCT_INIT_LHLR_MSK (0x1)

